In [1]:
# dependencies
import matplotlib.pyplot as plt
import pandas as pd
import scipy.stats as st
import numpy as np
from scipy.stats import linregress

master_csv = "archive/Master.csv"
salaries_csv = "archive/Salaries.csv"
teams_csv = "archive/Teams.csv"

In [2]:
#read in csv files
master_df = pd.read_csv(master_csv)
#master_df.head()
salaries_df = pd.read_csv(salaries_csv)
#salaries_df.head()
teams_df = pd.read_csv(teams_csv)
#teams_df

#filter batting df 
#filtered_batting_df = batting_df.loc[batting_df['yearID'] > 1999]
#filtered_batting_df
# Combine the data into a single dataset
bball_data_merge = pd.merge(master_df, salaries_df, how="left", on="playerID")

# Display the data table for preview
bball_data_merge.head()

,playerID,birthYear,birthMonth,birthDay,birthCountry,birthState,birthCity,deathYear,deathMonth,deathDay,...,bats,throws,debut,finalGame,retroID,bbrefID,yearID,teamID,lgID,salary
0,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,R,R,2004-04-06,2015-08-23,aardd001,aardsda01,2004.0,SFN,NL,300000.0
1,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,R,R,2004-04-06,2015-08-23,aardd001,aardsda01,2007.0,CHA,AL,387500.0
2,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,R,R,2004-04-06,2015-08-23,aardd001,aardsda01,2008.0,BOS,AL,403250.0
3,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,R,R,2004-04-06,2015-08-23,aardd001,aardsda01,2009.0,SEA,AL,419000.0
4,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,R,R,2004-04-06,2015-08-23,aardd001,aardsda01,2010.0,SEA,AL,2750000.0

In [3]:
list(bball_data_merge.columns)

['playerID',
 'birthYear',
 'birthMonth',
 'birthDay',
 'birthCountry',
 'birthState',
 'birthCity',
 'deathYear',
 'deathMonth',
 'deathDay',
 'deathCountry',
 'deathState',
 'deathCity',
 'nameFirst',
 'nameLast',
 'nameGiven',
 'weight',
 'height',
 'bats',
 'throws',
 'debut',
 'finalGame',
 'retroID',
 'bbrefID',
 'yearID',
 'teamID',
 'lgID',
 'salary']

In [4]:
#drop unneed columns
cleaned_df = bball_data_merge.drop(['birthMonth',
                                     'birthDay',
                                    'deathMonth',
                                     'deathDay',
                                     'deathCountry',
                                     'deathState',
                                     'deathCity'
                                     
                                    ], axis = 1)

cleaned_df.head()

,playerID,birthYear,birthCountry,birthState,birthCity,deathYear,nameFirst,nameLast,nameGiven,weight,...,bats,throws,debut,finalGame,retroID,bbrefID,yearID,teamID,lgID,salary
0,aardsda01,1981.0,USA,CO,Denver,NaN,David,Aardsma,David Allan,220.0,...,R,R,2004-04-06,2015-08-23,aardd001,aardsda01,2004.0,SFN,NL,300000.0
1,aardsda01,1981.0,USA,CO,Denver,NaN,David,Aardsma,David Allan,220.0,...,R,R,2004-04-06,2015-08-23,aardd001,aardsda01,2007.0,CHA,AL,387500.0
2,aardsda01,1981.0,USA,CO,Denver,NaN,David,Aardsma,David Allan,220.0,...,R,R,2004-04-06,2015-08-23,aardd001,aardsda01,2008.0,BOS,AL,403250.0
3,aardsda01,1981.0,USA,CO,Denver,NaN,David,Aardsma,David Allan,220.0,...,R,R,2004-04-06,2015-08-23,aardd001,aardsda01,2009.0,SEA,AL,419000.0
4,aardsda01,1981.0,USA,CO,Denver,NaN,David,Aardsma,David Allan,220.0,...,R,R,2004-04-06,2015-08-23,aardd001,aardsda01,2010.0,SEA,AL,2750000.0

In [5]:
list(cleaned_df.columns)

['playerID',
 'birthYear',
 'birthCountry',
 'birthState',
 'birthCity',
 'deathYear',
 'nameFirst',
 'nameLast',
 'nameGiven',
 'weight',
 'height',
 'bats',
 'throws',
 'debut',
 'finalGame',
 'retroID',
 'bbrefID',
 'yearID',
 'teamID',
 'lgID',
 'salary']

In [6]:
#cleaned_df['salary'].astype(float).dropna()

#df.dropna(subset = ["column2"], inplace=True)

cleaned_df = cleaned_df.rename(columns={'playerID': 'Player ID',
                                         'birthYear': 'Birth Year',
                                         'birthCountry': 'Birth Country',
                                         'birthState': 'Birth State',
                                         'birthCity': 'Birth City',
                                         'deathYear': "Death Year",
                                         'nameFirst': 'First Name',
                                         'nameLast': 'Last Name',
                                         'nameGiven': 'Full Name',
                                         'weight': 'Weight',
                                         'height': 'Height',
                                         'bats': 'Bats',
                                         'throws': 'Throws',
                                         'debut': 'Debut Date',
                                         'finalGame': 'Date of Last Game',
                                         'retroID': 'Retro ID',
                                         'bbrefID': 'BBRef ID',
                                         'yearID': 'Year ID',
                                         'teamID': 'Team ID',
                                         'lgID': 'League',
                                         'salary':'Salary'
                                     })
cleaned_df = pd.DataFrame(cleaned_df)
list(cleaned_df.columns)

['Player ID',
 'Birth Year',
 'Birth Country',
 'Birth State',
 'Birth City',
 'Death Year',
 'First Name',
 'Last Name',
 'Full Name',
 'Weight',
 'Height',
 'Bats',
 'Throws',
 'Debut Date',
 'Date of Last Game',
 'Retro ID',
 'BBRef ID',
 'Year ID',
 'Team ID',
 'League',
 'Salary']

In [7]:
salary_df = cleaned_df.drop([ 'Death Year',
                                     'First Name',
                                     'Last Name',
                                     'Full Name',
                                     'Weight',
                                     'Height',
                                     'Bats',
                                     'Throws',
                                     'Debut Date',
                                     'Date of Last Game',
                                     'Retro ID',
                                     'BBRef ID'
                                      ], axis = 1)
salary_df = salary_df.dropna()
salary_df = pd.DataFrame(salary_df)
salary_df.head()

,Player ID,Birth Year,Birth Country,Birth State,Birth City,Year ID,Team ID,League,Salary
0,aardsda01,1981.0,USA,CO,Denver,2004.0,SFN,NL,300000.0
1,aardsda01,1981.0,USA,CO,Denver,2007.0,CHA,AL,387500.0
2,aardsda01,1981.0,USA,CO,Denver,2008.0,BOS,AL,403250.0
3,aardsda01,1981.0,USA,CO,Denver,2009.0,SEA,AL,419000.0
4,aardsda01,1981.0,USA,CO,Denver,2010.0,SEA,AL,2750000.0

In [8]:
#group by birth city
birth_city = salary_df.groupby(['Birth City'])

#create each variable
player_count = birth_city['Player ID'].nunique()
mean_salary = birth_city.mean()['Salary']
median_salary = birth_city.median()['Salary']
var_salary = birth_city.var()['Salary']
std_dev_salary = birth_city.std()['Salary']
sems_salary = birth_city.sem()['Salary']

#player birth city summary table
summary_city_df = pd.DataFrame({"Number of Players": player_count,
                              "Mean Player Salary": mean_salary,
                              "Median Player Salary": median_salary,
                              "Player Salary Variance": var_salary,
                              "Player Salary Std. Dev.": std_dev_salary,
                              "Player Salary Std. Error": sems_salary})

#format columns
summary_city_df = summary_city_df.sort_values(by=['Number of Players'], ascending=False)
summary_city_df['Mean Player Salary'] = summary_city_df['Mean Player Salary'].map("${:,.0f}".format)
summary_city_df['Median Player Salary'] = summary_city_df['Median Player Salary'].map("${:,.0f}".format)
summary_city_df['Player Salary Variance'] = summary_city_df['Player Salary Variance'].map("${:,.0f}".format)
summary_city_df['Player Salary Std. Dev.'] = summary_city_df['Player Salary Std. Dev.'].map("${:,.0f}".format)
summary_city_df['Player Salary Std. Error'] = summary_city_df['Player Salary Std. Error'].map("${:,.0f}".format)

output_summary_city = summary_city_df.reset_index()

In [9]:
# Save summary_city_df as a csv
# Note to avoid any issues later, use encoding="utf-8"
output_summary_city.to_csv("salary_summary_city_WJR.csv", encoding="utf-8", index=False)

In [10]:
#group by birth state
birth_state = salary_df.groupby(['Birth State'])

#create each variable
player_count = birth_state['Player ID'].nunique()
mean_salary = birth_state.mean()['Salary']
median_salary = birth_state.median()['Salary']
var_salary = birth_state.var()['Salary']
std_dev_salary = birth_state.std()['Salary']
sems_salary = birth_state.sem()['Salary']

#player birth city summary table
summary_state_df = pd.DataFrame({"Number of Players": player_count,
                              "Mean Player Salary": mean_salary,
                              "Median Player Salary": median_salary,
                              "Player Salary Variance": var_salary,
                              "Player Salary Std. Dev.": std_dev_salary,
                              "Player Salary Std. Error": sems_salary})

#format columns
summary_state_df = summary_state_df.sort_values(by=['Number of Players'], ascending=False)
summary_state_df['Mean Player Salary'] = summary_state_df['Mean Player Salary'].map("${:,.0f}".format)
summary_state_df['Median Player Salary'] = summary_state_df['Median Player Salary'].map("${:,.0f}".format)
summary_state_df['Player Salary Variance'] = summary_state_df['Player Salary Variance'].map("${:,.0f}".format)
summary_state_df['Player Salary Std. Dev.'] = summary_state_df['Player Salary Std. Dev.'].map("${:,.0f}".format)
summary_state_df['Player Salary Std. Error'] = summary_state_df['Player Salary Std. Error'].map("${:,.0f}".format)

summary_state_df

,Number of Players,Mean Player Salary,Median Player Salary,Player Salary Variance,Player Salary Std. Dev.,Player Salary Std. Error
Birth State,,,,,,
CA,873,"$1,900,106","$550,000","$9,632,246,062,996","$3,103,586","$45,098"
TX,311,"$1,929,584","$514,900","$10,460,333,995,959","$3,234,244","$84,127"
FL,267,"$1,992,864","$540,000","$9,440,839,185,548","$3,072,595","$81,395"
IL,178,"$1,485,293","$500,000","$6,550,261,572,420","$2,559,348","$83,432"
NY,168,"$1,782,716","$550,000","$12,975,632,592,186","$3,602,171","$115,126"
...,...,...,...,...,...,...
Michoacan,1,"$5,471,000","$4,625,000","$27,565,340,571,429","$5,250,271","$1,856,251"
Sao Paulo,1,"$775,000","$775,000","$101,250,000,000","$318,198","$225,000"
Nara,1,"$3,000,000","$3,000,000",$nan,$nan,$nan
Fukuoka,1,"$933,333","$912,500","$60,416,666,667","$245,798","$100,347"
Ishikawa,1,"$9,250,000","$8,000,000","$13,625,000,000,000","$3,691,206","$1,230,402"

In [11]:
#group by birth country
birth_country = salary_df.groupby(['Birth Country'])

#create each variable
player_count = birth_country['Player ID'].nunique()
mean_salary = birth_country.mean()['Salary']
median_salary = birth_country.median()['Salary']
var_salary = birth_country.var()['Salary']
std_dev_salary = birth_country.std()['Salary']
sems_salary = birth_country.sem()['Salary']

#player birth city summary table
summary_country_df = pd.DataFrame({"Number of Players": player_count,
                              "Mean Player Salary": mean_salary,
                              "Median Player Salary": median_salary,
                              "Player Salary Variance": var_salary,
                              "Player Salary Std. Dev.": std_dev_salary,
                              "Player Salary Std. Error": sems_salary})

#format columns
summary_country_df = summary_country_df.sort_values(by=['Number of Players'], ascending=False)
summary_country_df['Mean Player Salary'] = summary_country_df['Mean Player Salary'].map("${:,.0f}".format)
summary_country_df['Median Player Salary'] = summary_country_df['Median Player Salary'].map("${:,.0f}".format)
summary_country_df['Player Salary Variance'] = summary_country_df['Player Salary Variance'].map("${:,.0f}".format)
summary_country_df['Player Salary Std. Dev.'] = summary_country_df['Player Salary Std. Dev.'].map("${:,.0f}".format)
summary_country_df['Player Salary Std. Error'] = summary_country_df['Player Salary Std. Error'].map("${:,.0f}".format)

summary_country_df

,Number of Players,Mean Player Salary,Median Player Salary,Player Salary Variance,Player Salary Std. Dev.,Player Salary Std. Error
Birth Country,,,,,,
USA,3846,"$1,892,828","$525,000","$10,071,535,866,923","$3,173,568","$22,509"
D.R.,407,"$2,382,288","$575,000","$15,007,166,603,572","$3,873,908","$85,854"
Venezuela,203,"$2,449,393","$531,250","$16,158,920,100,074","$4,019,816","$126,237"
Mexico,63,"$1,510,801","$503,500","$5,087,348,669,277","$2,255,515","$126,087"
CAN,61,"$2,595,041","$600,000","$14,855,621,352,125","$3,854,299","$223,649"
Cuba,41,"$2,751,700","$1,625,000","$8,051,138,539,105","$2,837,453","$202,160"
Japan,40,"$4,922,597","$3,250,000","$23,467,592,888,480","$4,844,336","$379,438"
Panama,21,"$3,470,999","$766,593","$25,504,563,497,738","$5,050,204","$470,934"
Australia,18,"$1,024,021","$460,000","$1,574,568,620,634","$1,254,818","$147,882"
Colombia,8,"$3,074,052","$1,000,000","$11,282,880,621,359","$3,359,000","$475,034"
United Kingdom,3,"$454,833","$475,000","$81,893,536,232","$286,170","$58,414"
Germany,2,"$885,900","$695,000","$438,686,322,222","$662,334","$209,448"
South Korea,2,"$3,388,778","$3,333,333","$842,277,833,296","$917,757","$529,867"
V.I.,2,"$322,333","$250,000","$60,767,988,095","$246,512","$63,649"
Belgium,1,"$170,000","$163,000","$3,228,666,667","$56,821","$28,411"
Nicaragua,1,"$1,525,500","$850,000","$2,966,823,625,000","$1,722,447","$574,149"
Brazil,1,"$775,000","$775,000","$101,250,000,000","$318,198","$225,000"

In [14]:
#MLB city salary summary
#city salary summary data file
city_salary_path = "../group_1_project/salary_summary_city_WJR.csv"

#read the city salary data file
city_salary_df = pd.read_csv(city_salary_path, dtype="object", encoding="utf-8")
city_salary_df.head()

,Birth City,Number of Players,Mean Player Salary,Median Player Salary,Player Salary Variance,Player Salary Std. Dev.,Player Salary Std. Error
0,Santo Domingo,101,"$3,248,984","$850,000","$22,884,226,051,220","$4,783,746","$212,663"
1,Houston,69,"$2,453,520","$587,500","$13,879,995,134,875","$3,725,587","$200,870"
2,Los Angeles,69,"$1,656,127","$750,000","$5,025,661,374,225","$2,241,799","$104,185"
3,San Pedro de Macoris,58,"$2,356,954","$630,000","$17,193,946,423,920","$4,146,558","$232,163"
4,San Diego,53,"$2,437,525","$750,000","$16,178,890,027,380","$4,022,299","$232,228"